# users = ['Tom', 'Nick', 'Ann']
# users2 = ['Sam', 'Tom', 'Bob', 'Alice', 'Joe']
# c = []
# for i in users:
#     if not (i in users2):
#         c.append(i)
# print(c)


# Задача 2

# students = {"Tom", "Bob", "Sam"}
# employees = {"Tom", "Bob", "Alex", "Mike"}
#
# print("Все люди в группах:", students.union(employees))
# print("Одновременно учатся и работают:", students.intersection(employees))
# print("Только учатся", students.difference(employees))
# print("Либо только учатся, либо только работают:", students.symmetric_difference(employees))

# Задача 3

# a = (2, 4)
# position_from_zero = (a[0] ** 2 + a[1] ** 2) ** 0.5
# print(f'расстояние от начала координат: {position_from_zero}')

